DawoudTormos/Acces_Control_-Fingerprint_stm32/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2023 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define LED_Pin GPIO_PIN_13
#define LED_GPIO_Port GPIOC
#define BT_RX_Pin GPIO_PIN_2
#define BT_RX_GPIO_Port GPIOA
#define BT_TX_Pin GPIO_PIN_3
#define BT_TX_GPIO_Port GPIOA
#define TOUCH_SENS_Pin GPIO_PIN_1
#define TOUCH_SENS_GPIO_Port GPIOB
#define MD_EN_Pin GPIO_PIN_13
#define MD_EN_GPIO_Port GPIOB
#define MD_IN2_Pin GPIO_PIN_14
#define MD_IN2_GPIO_Port GPIOB
#define MD_IN1_Pin GPIO_PIN_15
#define MD_IN1_GPIO_Port GPIOB
#define FP_RX_Pin GPIO_PIN_9
#define FP_RX_GPIO_Port GPIOA
#define FP_TX_Pin GPIO_PIN_10
#define FP_TX_GPIO_Port GPIOA
#define FP_IRQ_Pin GPIO_PIN_4
#define FP_IRQ_GPIO_Port GPIOB
#define FP_IRQ_EXTI_IRQn EXTI4_IRQn
#define RED_Pin GPIO_PIN_6
#define RED_GPIO_Port GPIOB
#define YELLOW_Pin GPIO_PIN_7
#define YELLOW_GPIO_Port GPIOB
#define GREEN_Pin GPIO_PIN_8
#define GREEN_GPIO_Port GPIOB
#define LOCK_Pin GPIO_PIN_9
#define LOCK_GPIO_Port GPIOB

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
